vlm/base/Documents/бит_ПартияЗавесов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ПартияЗавесов</Name>
			<Comment>ЛТ5.32</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СменыВесовщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеСмены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Весовщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контроллер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/Documents/бит_ПартияЗавесов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
#Область ДляВызоваИзДругихПодсистем
#КонецОбласти 

#Область Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "бит_ПартияЗавесов"; 
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
    КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;	
	КомандаПечати.Представление = НСтр("ru = 'Партия завесов'"); 
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "бит_ПартияЗавесов");
	
	Если ПечатнаяФорма <> Неопределено Тогда
		
		Заголовок = НСтр("ru = '(бит) Партия завесов'");
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"бит_ПартияЗавесов", 
		Заголовок,
		СформироватьПечатнуюФормуПартияЗавесов(МассивОбъектов),
		,
		"Документ.бит_ПартияЗавесов.ПФ_MXL_ПартияЗавесов");
		
	КонецЕсли; 

КонецПроцедуры   

Функция СформироватьПечатнуюФормуПартияЗавесов(МассивОбъектов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);  
	ПараметрыПечати = ИСТИНА;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ПолеСверху = 5;
	ТабличныйДокумент.ПолеСлева= 5;
	ТабличныйДокумент.ПолеСнизу = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	
	ТабличныйДокумент.КлючПараметровПечати = "ПФ_MXL_ПартияЗавесов";
	
	Макет = ПолучитьМакет("ПФ_MXL_ПартияЗавесов");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвалЗаголовок = Макет.ПолучитьОбласть("ПодвалЗаголовок");
	ОбластьПодвалСтрока = Макет.ПолучитьОбласть("ПодвалСтрока");
	ОбластьПодвалПодвал = Макет.ПолучитьОбласть("ПодвалПодвал");
	
	Первый = Истина;
	Для Каждого ЭлМассива Из МассивОбъектов Цикл
		Если Первый Тогда
			Первый = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		СтруктураШапки = Новый Структура;
		СтруктураШапки.Вставить("Партия", СтрШаблон("№%1 от %2", ЭлМассива.Номер, Формат(ЭлМассива.Дата, "ДФ=dd.MM.yyyy")));
		СтруктураШапки.Вставить("Смена", ЭлМассива.Смена);
		ОбластьШапка.Параметры.Заполнить(СтруктураШапки);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Для каждого стр из ЭлМассива.ДанныеСмены Цикл
			ОбластьСтрока.Параметры.Заполнить(стр);	
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ОбластьПодвалЗаголовок.Параметры.ОбщееКоличество = ЭлМассива.ДанныеСмены.Количество();
		ТабличныйДокумент.Вывести(ОбластьПодвалЗаголовок);
		
		ТаблицаПоТарам = ЭлМассива.ДанныеСмены.Выгрузить(, "Тара"); 
		ТаблицаПоТарам.Колонки.Добавить("КолВо");
		ТаблицаПоТарам.Заполнитьзначения(1, "КолВо");
		ТаблицаПоТарам.Свернуть("Тара", "КолВо");
		Для каждого текТара из ТаблицаПоТарам Цикл
			ОбластьПодвалСтрока.Параметры.Заполнить(текТара);
			ТабличныйДокумент.Вывести(ОбластьПодвалСтрока);
		КонецЦикла;
		
		ОбластьПодвалПодвал.Параметры.ОбщееКГВПартии = ЭлМассива.ДанныеСмены.Итог("Количество");
		ТабличныйДокумент.Вывести(ОбластьПодвалПодвал);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт
	
	МассивДоступныхПечатныхФорм = Новый Массив;
	
	Возврат МассивДоступныхПечатныхФорм

КонецФункции

Функция НайтиНазначение(Номенклатура, Серия) Экспорт
	// Назначение берется из документа "Этап производства" - "Заказ на производство" ТЧ Товары - "Назначение"
	//Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	//                      |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Распоряжение КАК Распоряжение
	//                      |ПОМЕСТИТЬ втЗаказНаПроизводство
	//                      |ИЗ
	//                      |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	//                      |ГДЕ
	//                      |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура
	//                      |	И ЭтапПроизводства2_2ВыходныеИзделия.Серия = &Серия
	//                      |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	//                      |;
	//                      |
	//                      |////////////////////////////////////////////////////////////////////////////////
	//                      |ВЫБРАТЬ ПЕРВЫЕ 1
	//                      |	ЗаказНаПроизводство2_2Продукция.Назначение КАК Назначение
	//                      |ИЗ
	//                      |	втЗаказНаПроизводство КАК втЗаказНаПроизводство
	//                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
	//                      |		ПО втЗаказНаПроизводство.Распоряжение = ЗаказНаПроизводство2_2Продукция.Ссылка
	//                      |ГДЕ
	//                      |	ЗаказНаПроизводство2_2Продукция.Номенклатура = &Номенклатура");  
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение
		                      |ИЗ
		                      |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
		                      |ГДЕ
		                      |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура
		                      |	И ЭтапПроизводства2_2ВыходныеИзделия.Серия = &Серия
		                      |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен");

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Серия", Серия);  
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Назначение = Выборка.Назначение;
	иначе
		Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Назначение;
	
КонецФункции

#КонецОбласти
#КонецОбласти
#КонецЕсли
